In [1]:
import pandas as pd

df1 = pd.DataFrame({'Salario': [30000, 45000, 38000],
                    'Antigüedad': [9, 13, 12]},
                   index=[1, 2, 3])
df2 = pd.DataFrame({'Ciudad': ['Madrid', 'Barcelona', 'Valencia'],
                    'Jerarquía': ['Baja', 'Alta', 'Media']},
                   index=[1, 2, 4])

In [2]:
df1

   Salario  Antigüedad
1    30000           9
2    45000          13
3    38000          12

In [3]:
df2

      Ciudad Jerarquía
1     Madrid      Baja
2  Barcelona      Alta
4   Valencia     Media

En el metodo join el parametro por default esta como left, pero eso no significa que no podamos cambiarlo

In [4]:
df_unido = df1.join(df2)
df_unido

   Salario  Antigüedad     Ciudad Jerarquía
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta
3    38000          12        NaN       NaN

In [6]:
df_unido = df1.join(df2, how='right')
df_unido

   Salario  Antigüedad     Ciudad Jerarquía
1  30000.0         9.0     Madrid      Baja
2  45000.0        13.0  Barcelona      Alta
4      NaN         NaN   Valencia     Media